j20-immigration/j20-immigration.org
#+OPTIONS: broken-links:t todo:nil
#+AUTHOR: Hawaii J20
#+hugo_base_dir: /home/dk/Public/projects/958-web-site/public-node/j20-immigration/
#+hugo_auto_set_lastmod: t
** DONE What is wrong with deporting undocumented aliens?
   CLOSED: [2018-06-23 Sat 07:34]
   :PROPERTIES:
   :EXPORT_FILE_NAME: wrong-with-deporting
   :EXPORT_HUGO_MENU: :menu "main"
   :END:

*** Question:
Why shouldn’t undocumented immigrants be deported?

*** Background:

Undocumented immigrants [[https://www.newamericaneconomy.org/issues/undocumented-immigrants/][work]], [[https://bipartisanpolicy.org/blog/how-do-undocumented-immigrants-pay-federal-taxes-an-explainer/][pay taxes]], and [[https://professionals.collegeboard.org/guidance/financial-aid/undocumented-students][send their children to school]].
Some, such as the Kona coffee farmer, [[http://www.staradvertiser.com/2017/07/08/breaking-news/kona-coffee-farmer-says-goodbye-to-family-ahead-of-deportation/][Andres Magana Ortiz]], are leaders in our
communities. Many are married to U.S. citizens, and many of their [[http://www.alllaw.com/articles/nolo/us-immigration/can-child-undocumented-immigrant-become-citizen.html][children are
U.S. citizens by birth]].

*** Answer:
The estimated 45,000 undocumented immigrants living in Hawaii are so well
integrated into our communities that even their friends and neighbors may not
know they are undocumented. Deporting undocumented immigrants would break up
families and remove the main source of financial support for many minor
children.

