j20-immigration/content/post/wrong-with-deporting.md
+++
title = "What is wrong with deporting undocumented aliens?"
author = ["Hawaii J20"]
date = 2018-06-23T07:34:00-10:00
lastmod = 2018-08-04T18:04:08-10:00
draft = false
[menu.main]
  weight = 2003
  identifier = "what-is-wrong-with-deporting-undocumented-aliens"
+++

## Question: {#question}

Why shouldn’t undocumented immigrants be deported?


## Background: {#background}

Undocumented immigrants [work](https://www.newamericaneconomy.org/issues/undocumented-immigrants/), [pay taxes](https://bipartisanpolicy.org/blog/how-do-undocumented-immigrants-pay-federal-taxes-an-explainer/), and [send their children to school](https://professionals.collegeboard.org/guidance/financial-aid/undocumented-students).
Some, such as the Kona coffee farmer, [Andres Magana Ortiz](http://www.staradvertiser.com/2017/07/08/breaking-news/kona-coffee-farmer-says-goodbye-to-family-ahead-of-deportation/), are leaders in our
communities. Many are married to U.S. citizens, and many of their [children are
U.S. citizens by birth](http://www.alllaw.com/articles/nolo/us-immigration/can-child-undocumented-immigrant-become-citizen.html).


## Answer: {#answer}

The estimated 45,000 undocumented immigrants living in Hawaii are so well
integrated into our communities that even their friends and neighbors may not
know they are undocumented. Deporting undocumented immigrants would break up
families and remove the main source of financial support for many minor
children.
